duvallee/STM32F746Discovery/Src/main.c
}

/* --------------------------------------------------------------------------
 * Name : MX_TIM6_Init()
 *
 *
 * -------------------------------------------------------------------------- */
/* TIM6 init function */
static void MX_TIM6_Init(void)
{
#if 0
   TIM_MasterConfigTypeDef sMasterConfig;

   htim6.Instance                                        = TIM6;
   htim6.Init.Prescaler                                  = 0;
   htim6.Init.CounterMode                                = TIM_COUNTERMODE_UP;
   htim6.Init.Period                                     = 0;
   htim6.Init.AutoReloadPreload                          = TIM_AUTORELOAD_PRELOAD_DISABLE;
   if (HAL_TIM_Base_Init(&htim6) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }

   sMasterConfig.MasterOutputTrigger                     = TIM_TRGO_RESET;
   sMasterConfig.MasterSlaveMode                         = TIM_MASTERSLAVEMODE_DISABLE;
   if (HAL_TIMEx_MasterConfigSynchronization(&htim6, &sMasterConfig) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }
#endif
}

#if defined(DEBUG_OUTPUT_UART)
/* --------------------------------------------------------------------------
 * Name : MX_USART6_UART_Init()
 *
 *
 * -------------------------------------------------------------------------- */
static void MX_USART6_UART_Init(void)
{
   huart6.Instance                                       = USART6;
   huart6.Init.BaudRate                                  = 115200;
   huart6.Init.WordLength                                = UART_WORDLENGTH_8B;
   huart6.Init.StopBits                                  = UART_STOPBITS_1;
   huart6.Init.Parity                                    = UART_PARITY_NONE;
   huart6.Init.Mode                                      = UART_MODE_TX_RX;
   huart6.Init.HwFlowCtl                                 = UART_HWCONTROL_NONE;
   huart6.Init.OverSampling                              = UART_OVERSAMPLING_16;
   huart6.Init.OneBitSampling                            = UART_ONE_BIT_SAMPLE_DISABLE;
   huart6.AdvancedInit.AdvFeatureInit                    = UART_ADVFEATURE_NO_INIT;
   if (HAL_UART_Init(&huart6) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }
}
#endif

#if defined(DEBUG_OUTPUT_USB)
/* --------------------------------------------------------------------------
 * Name : MX_USB_DEVICE_Init()
 *
 *
 * -------------------------------------------------------------------------- */
static void MX_USB_DEVICE_Init(void)
{
   /* Init Device Library,Add Supported Class and Start the library*/
   USBD_Init(&hUsbDeviceFS, &FS_Desc, DEVICE_FS);
   USBD_RegisterClass(&hUsbDeviceFS, &USBD_CDC);
   USBD_CDC_RegisterInterface(&hUsbDeviceFS, &USBD_Interface_fops_FS);
#if 0
   USBD_Start(&hUsbDeviceFS);
#endif
}
#endif

/* --------------------------------------------------------------------------
 * Name : MX_TIM1_Init()
 *        TIM1 init function
 *
 * -------------------------------------------------------------------------- */
static void MX_TIM1_Init(void)
{
   TIM_ClockConfigTypeDef sClockSourceConfig;
   TIM_MasterConfigTypeDef sMasterConfig;
   TIM_OC_InitTypeDef sConfigOC;
   TIM_BreakDeadTimeConfigTypeDef sBreakDeadTimeConfig;
   GPIO_InitTypeDef GPIO_InitStruct;

   htim1.Instance                                        = TIM1;
   // 1 us = 1 / (100 MHz / 100)
   htim1.Init.Prescaler                                  = 100;
   htim1.Init.CounterMode                                = TIM_COUNTERMODE_UP;
   // 20 ms
   htim1.Init.Period                                     = 20000;
   htim1.Init.ClockDivision                              = TIM_CLOCKDIVISION_DIV1;
   htim1.Init.RepetitionCounter                          = 0;
   htim1.Init.AutoReloadPreload                          = TIM_AUTORELOAD_PRELOAD_DISABLE;
   if (HAL_TIM_Base_Init(&htim1) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }

   sClockSourceConfig.ClockSource                        = TIM_CLOCKSOURCE_INTERNAL;
   if (HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }

   if (HAL_TIM_PWM_Init(&htim1) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }

   sMasterConfig.MasterOutputTrigger                     = TIM_TRGO_RESET;
   sMasterConfig.MasterOutputTrigger2                    = TIM_TRGO2_RESET;
   sMasterConfig.MasterSlaveMode                         = TIM_MASTERSLAVEMODE_DISABLE;
   if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }

   sConfigOC.OCMode                                      = TIM_OCMODE_PWM1;
   sConfigOC.Pulse                                       = 700;
   sConfigOC.OCPolarity                                  = TIM_OCPOLARITY_HIGH;
   sConfigOC.OCNPolarity                                 = TIM_OCNPOLARITY_HIGH;
   sConfigOC.OCFastMode                                  = TIM_OCFAST_DISABLE;
   sConfigOC.OCIdleState                                 = TIM_OCIDLESTATE_RESET;
   sConfigOC.OCNIdleState                                = TIM_OCNIDLESTATE_RESET;
   if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }

   sBreakDeadTimeConfig.OffStateRunMode                  = TIM_OSSR_DISABLE;
   sBreakDeadTimeConfig.OffStateIDLEMode                 = TIM_OSSI_DISABLE;
   sBreakDeadTimeConfig.LockLevel                        = TIM_LOCKLEVEL_OFF;
   sBreakDeadTimeConfig.DeadTime                         = 0;
   sBreakDeadTimeConfig.BreakState                       = TIM_BREAK_DISABLE;
   sBreakDeadTimeConfig.BreakPolarity                    = TIM_BREAKPOLARITY_HIGH;
   sBreakDeadTimeConfig.BreakFilter                      = 0;
   sBreakDeadTimeConfig.Break2State                      = TIM_BREAK2_DISABLE;
   sBreakDeadTimeConfig.Break2Polarity                   = TIM_BREAK2POLARITY_HIGH;
   sBreakDeadTimeConfig.Break2Filter                     = 0;
   sBreakDeadTimeConfig.AutomaticOutput                  = TIM_AUTOMATICOUTPUT_DISABLE;
   if (HAL_TIMEx_ConfigBreakDeadTime(&htim1, &sBreakDeadTimeConfig) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }

   /**TIM1 GPIO Configuration    
   PA8     ------> TIM1_CH1 
   */
   GPIO_InitStruct.Pin                                   = GPIO_PIN_8;
   GPIO_InitStruct.Mode                                  = GPIO_MODE_AF_PP;
   GPIO_InitStruct.Pull                                  = GPIO_NOPULL;
   GPIO_InitStruct.Speed                                 = GPIO_SPEED_FREQ_LOW;
   GPIO_InitStruct.Alternate                             = GPIO_AF1_TIM1;
   HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

/* --------------------------------------------------------------------------
 * Name : TIM12 init function()
 *
 *
 * -------------------------------------------------------------------------- */
static void MX_TIM12_Init(void)
{
   TIM_ClockConfigTypeDef sClockSourceConfig;
   TIM_OC_InitTypeDef sConfigOC;
   GPIO_InitTypeDef GPIO_InitStruct;

   htim12.Instance                                       = TIM12;
   // 1 us = 1 / (54 MHz / 54)
   htim12.Init.Prescaler                                 = 54;
   htim12.Init.CounterMode                               = TIM_COUNTERMODE_UP;
   // 20 ms
   htim12.Init.Period                                    = 20000;
   htim12.Init.ClockDivision                             = TIM_CLOCKDIVISION_DIV1;
   htim12.Init.AutoReloadPreload                         = TIM_AUTORELOAD_PRELOAD_DISABLE;
   if (HAL_TIM_Base_Init(&htim12) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }

   sClockSourceConfig.ClockSource                        = TIM_CLOCKSOURCE_INTERNAL;
   if (HAL_TIM_ConfigClockSource(&htim12, &sClockSourceConfig) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }

